; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 556961 2 2 3 8 3
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	spectrograph2 - mode
	infrared1 - mode
	infrared0 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star5 - direction
	GroundStation7 - direction
	GroundStation6 - direction
	Star2 - direction
	Star8 - direction
	Planet9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 GroundStation6)
	(supports instrument1 infrared0)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 GroundStation6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star2)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
)
(:goal (and
	(have_image Star8 infrared0)
	(have_image Planet9 spectrograph2)
	(have_image Phenomenon10 infrared1)
))

)

; plan
1. (turn_to satellite0 star8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star8)
   goals met: 0 of 3
2. (turn_to satellite1 star8 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 star8)
   goals met: 0 of 3
3. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 3
4. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 3
5. (turn_to satellite0 groundstation6 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 groundstation6)
   goals met: 0 of 3
6. (turn_to satellite1 star2 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star2)
   goals met: 0 of 3
7. (calibrate satellite0 instrument1 groundstation6)
   added: (calibrated instrument1)
   goals met: 0 of 3
8. (calibrate satellite1 instrument2 star2)
   added: (calibrated instrument2)
   goals met: 0 of 3
9. (turn_to satellite0 planet9 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 planet9)
   goals met: 0 of 3
10. (turn_to satellite1 star8 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 star8)
   goals met: 0 of 3
11. (take_image satellite0 planet9 instrument1 spectrograph2)
   added: (have_image planet9 spectrograph2)
   goals met: 1 of 3
12. (take_image satellite1 star8 instrument2 infrared0)
   added: (have_image star8 infrared0)
   goals met: 2 of 3
13. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 2 of 3
14. (turn_to satellite0 phenomenon10 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 phenomenon10)
   goals met: 2 of 3
15. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 3
16. (turn_to satellite0 groundstation6 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 groundstation6)
   goals met: 2 of 3
17. (calibrate satellite0 instrument0 groundstation6)
   added: (calibrated instrument0)
   goals met: 2 of 3
18. (turn_to satellite0 phenomenon10 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 phenomenon10)
   goals met: 2 of 3
19. (take_image satellite0 phenomenon10 instrument0 infrared1)
   added: (have_image phenomenon10 infrared1)
   goals met: 3 of 3
